<a href="https://colab.research.google.com/github/Codinggenttleman/202010/blob/main/Untitled4.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [4]:
import numpy as np
import pandas as pd

df = pd.DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'],
                   'key2' : ['one', 'two', 'one', 'two', 'one'],
                   'data1' : np.random.randn(5),
                   'data2' : np.random.randn(5)})
df

  key1 key2     data1     data2
0    a  one  0.190024 -1.778865
1    a  two -1.255565  0.235236
2    b  one -1.081029 -0.493842
3    b  two  0.580766  0.415808
4    a  one -2.000759  1.622076

In [6]:
grouped = df['data1'].groupby(df['key1'])
grouped

In [7]:
grouped.mean()

key1
a   -1.022100
b   -0.250132
Name: data1, dtype: float64

In [9]:
means = df['data1'].groupby([df['key1'], df['key2']]).mean()
means

key1  key2
a     one    -0.905367
      two    -1.255565
b     one    -1.081029
      two     0.580766
Name: data1, dtype: float64

In [10]:
means.unstack()

key2       one       two
key1
a    -0.905367 -1.255565
b    -1.081029  0.580766

In [11]:
states = np.array(['Ohio', 'California', 'California', 'Ohio', 'Ohio'])
years = np.array([2005, 2005, 2006, 2005, 2006])
df['data1'].groupby([states, years]).mean()

California  2005   -1.255565
            2006   -1.081029
Ohio        2005    0.385395
            2006   -2.000759
Name: data1, dtype: float64

In [13]:
df.groupby('key1').mean()

         data1     data2
key1
a    -1.022100  0.026149
b    -0.250132 -0.039017

In [14]:
df.groupby(['key1', 'key2']).mean()

              data1     data2
key1 key2
a    one  -0.905367 -0.078394
     two  -1.255565  0.235236
b    one  -1.081029 -0.493842
     two   0.580766  0.415808

In [15]:
for name, group in df.groupby('key1'):
  print(name)
  print(group)

a
  key1 key2     data1     data2
0    a  one  0.190024 -1.778865
1    a  two -1.255565  0.235236
4    a  one -2.000759  1.622076
b
  key1 key2     data1     data2
2    b  one -1.081029 -0.493842
3    b  two  0.580766  0.415808

In [16]:
for(k1,k2),group in df.groupby(['key1', 'key2']):
  print((k1,k2))
  print(group)

('a', 'one')
  key1 key2     data1     data2
0    a  one  0.190024 -1.778865
4    a  one -2.000759  1.622076
('a', 'two')
  key1 key2     data1     data2
1    a  two -1.255565  0.235236
('b', 'one')
  key1 key2     data1     data2
2    b  one -1.081029 -0.493842
('b', 'two')
  key1 key2     data1     data2
3    b  two  0.580766  0.415808

In [19]:
pieces = dict(list(df.groupby('key1')))
pieces['b']

  key1 key2     data1     data2
2    b  one -1.081029 -0.493842
3    b  two  0.580766  0.415808

In [20]:
df.dtypes

key1      object
key2      object
data1    float64
data2    float64
dtype: object

In [21]:
grouped = df.groupby(df.dtypes, axis=1)
for dtype, group in grouped:
  print(dtype)
  print(group)

float64
      data1     data2
0  0.190024 -1.778865
1 -1.255565  0.235236
2 -1.081029 -0.493842
3  0.580766  0.415808
4 -2.000759  1.622076
object
  key1 key2
0    a  one
1    a  two
2    b  one
3    b  two
4    a  one

In [25]:
df.groupby('key1')['data1'] 
df.groupby('key1')[['data2']]
df['data1'].groupby(df['key1']) 
df[['data2']].groupby(df['key1'])

df.groupby(['key1', 'key2'])[['data2']].mean()

              data2
key1 key2
a    one  -0.078394
     two   0.235236
b    one  -0.493842
     two   0.415808

In [26]:
s_grouped = df.groupby(['key1', 'key2'])['data2']
s_grouped

In [27]:
s_grouped.mean()

key1  key2
a     one    -0.078394
      two     0.235236
b     one    -0.493842
      two     0.415808
Name: data2, dtype: float64

In [28]:
people = pd.DataFrame(np.random.randn(5, 5),
                      columns=['a', 'b', 'c', 'd', 'e'], 
                      index=['Joe', 'Steve', 'Wes', 'Jim', 'Travis'])

In [31]:
people = pd.DataFrame(np.random.randn(5, 5),
                      columns=['a', 'b', 'c', 'd', 'e'],
                      index= ['Joe', 'Steve', 'Wes', 'Jim', 'Trabies'])
people.iloc[2:3, [1,2]] = np.nan
people

                a         b         c         d         e
Joe      1.148629 -0.511188 -1.077229  1.118325 -1.247751
Steve    0.942056 -0.169567 -1.745631  0.821350  2.002189
Wes     -0.518770       NaN       NaN  0.006890  0.376049
Jim     -0.058059  0.517731  1.453635  0.331858  0.299988
Trabies -1.618533  3.484218 -2.468599 -0.707585  1.697818

In [33]:
mapping = {'a':'red', 'b': 'red', 'c':'blue',
           'd':'blue', 'e':'red', 'f':'orange'}
by_column = people.groupby(mapping, axis=1)
by_column.sum()

             blue       red
Joe      0.041097 -0.610310
Steve   -0.924282  2.774679
Wes      0.006890 -0.142721
Jim      1.785493  0.759660
Trabies -3.176183  3.563504

In [34]:
map_series = pd.Series(mapping)
map_series

a       red
b       red
c      blue
d      blue
e       red
f    orange
dtype: object

In [35]:
people.groupby(map_series, axis=1).count()

         blue  red
Joe         2    3
Steve       2    3
Wes         1    2
Jim         2    3
Trabies     2    3

In [36]:
people.groupby(len).sum()

          a         b         c         d         e
3  0.571800  0.006543  0.376406  1.457074 -0.571714
5  0.942056 -0.169567 -1.745631  0.821350  2.002189
7 -1.618533  3.484218 -2.468599 -0.707585  1.697818

In [38]:
key_list = ['one', 'one', 'one', 'two', 'two']

people.groupby([len, key_list]).min()

              a         b         c         d         e
3 one -0.518770 -0.511188 -1.077229  0.006890 -1.247751
  two -0.058059  0.517731  1.453635  0.331858  0.299988
5 one  0.942056 -0.169567 -1.745631  0.821350  2.002189
7 two -1.618533  3.484218 -2.468599 -0.707585  1.697818

In [40]:
columns = pd.MultiIndex.from_arrays([['US', 'US', 'US', 'JP', 'JP'],
                                     [1, 3, 5, 1, 3]],
                                    names=['cty', 'tenor'])
hier_df = pd.DataFrame(np.random.randn(4, 5), columns=columns)
hier_df

cty          US                            JP
tenor         1         3         5         1         3
0     -0.082000  0.429442 -0.535832 -2.096741 -0.477097
1      0.002625  0.368058 -0.129185  0.474811  0.376806
2     -0.628412  0.200569  0.180016 -0.600915  0.927660
3     -2.071235 -0.691469 -0.551748 -0.687513 -1.942648

In [41]:
hier_df.groupby(level='cty', axis=1).count()

cty  JP  US
0     2   3
1     2   3
2     2   3
3     2   3

In [42]:
df

  key1 key2     data1     data2
0    a  one  0.190024 -1.778865
1    a  two -1.255565  0.235236
2    b  one -1.081029 -0.493842
3    b  two  0.580766  0.415808
4    a  one -2.000759  1.622076

In [44]:
grouped = df.groupby('key1')
grouped['data1'].quantile(0.9)

key1
a   -0.099094
b    0.414587
Name: data1, dtype: float64

In [46]:
def peak_to_peak(arr):
  return arr.max() - arr.min()
grouped.agg(peak_to_peak)

         data1     data2
key1
a     2.190784  3.400941
b     1.661795  0.909650

In [48]:
grouped.describe()

     data1                      ...     data2
     count      mean       std  ...       50%       75%       max
key1                            ...
a      3.0 -1.022100  1.113895  ...  0.235236  0.928656  1.622076
b      2.0 -0.250132  1.175067  ... -0.039017  0.188395  0.415808

[2 rows x 16 columns]

In [49]:
tips = pd.read_csv('tips.csv')
tips['tip_pct'] = tips['tip']/tips['total_bill']
tips[:6]

   total_bill   tip smoker  day    time  size   tip_pct
0       16.99  1.01     No  Sun  Dinner     2  0.059447
1       10.34  1.66     No  Sun  Dinner     3  0.160542
2       21.01  3.50     No  Sun  Dinner     3  0.166587
3       23.68  3.31     No  Sun  Dinner     2  0.139780
4       24.59  3.61     No  Sun  Dinner     4  0.146808
5       25.29  4.71     No  Sun  Dinner     4  0.186240

In [51]:
grouped = tips.groupby(['day', 'smoker'])
grouped_pct = grouped['tip_pct']
grouped_pct.agg('mean')

day   smoker
Fri   No        0.151650
      Yes       0.174783
Sat   No        0.158048
      Yes       0.147906
Sun   No        0.160113
      Yes       0.187250
Thur  No        0.160298
      Yes       0.163863
Name: tip_pct, dtype: float64

In [52]:
grouped_pct.agg(['mean','std',peak_to_peak])

                 mean       std  peak_to_peak
day  smoker
Fri  No      0.151650  0.028123      0.067349
     Yes     0.174783  0.051293      0.159925
Sat  No      0.158048  0.039767      0.235193
     Yes     0.147906  0.061375      0.290095
Sun  No      0.160113  0.042347      0.193226
     Yes     0.187250  0.154134      0.644685
Thur No      0.160298  0.038774      0.193350
     Yes     0.163863  0.039389      0.151240

In [53]:
grouped_pct.agg([('foo', 'mean'), ('bar', np.std)])

                  foo       bar
day  smoker
Fri  No      0.151650  0.028123
     Yes     0.174783  0.051293
Sat  No      0.158048  0.039767
     Yes     0.147906  0.061375
Sun  No      0.160113  0.042347
     Yes     0.187250  0.154134
Thur No      0.160298  0.038774
     Yes     0.163863  0.039389

In [54]:
functions = ['count', 'mean', 'max']
result = grouped['tip_pct', 'total_bill'].agg(functions)
result

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:2: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.

            tip_pct                     total_bill
              count      mean       max      count       mean    max
day  smoker
Fri  No           4  0.151650  0.187735          4  18.420000  22.75
     Yes         15  0.174783  0.263480         15  16.813333  40.17
Sat  No          45  0.158048  0.291990         45  19.661778  48.33
     Yes         42  0.147906  0.325733         42  21.276667  50.81
Sun  No          57  0.160113  0.252672         57  20.506667  48.17
     Yes         19  0.187250  0.710345         19  24.120000  45.35
Thur No          45  0.160298  0.266312         45  17.113111  41.19
     Yes         17  0.163863  0.241255         17  19.190588  43.11

In [55]:
result['tip_pct']

             count      mean       max
day  smoker
Fri  No          4  0.151650  0.187735
     Yes        15  0.174783  0.263480
Sat  No         45  0.158048  0.291990
     Yes        42  0.147906  0.325733
Sun  No         57  0.160113  0.252672
     Yes        19  0.187250  0.710345
Thur No         45  0.160298  0.266312
     Yes        17  0.163863  0.241255

In [56]:
ftuples=[('Durchschnitt', 'mean'), ('Abweichung',np.var)]
grouped['tip_pct', 'total_bill'].agg(ftuples)

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:2: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.

                 tip_pct              total_bill
            Durchschnitt Abweichung Durchschnitt  Abweichung
day  smoker
Fri  No         0.151650   0.000791    18.420000   25.596333
     Yes        0.174783   0.002631    16.813333   82.562438
Sat  No         0.158048   0.001581    19.661778   79.908965
     Yes        0.147906   0.003767    21.276667  101.387535
Sun  No         0.160113   0.001793    20.506667   66.099980
     Yes        0.187250   0.023757    24.120000  109.046044
Thur No         0.160298   0.001503    17.113111   59.625081
     Yes        0.163863   0.001551    19.190588   69.808518

In [57]:
grouped.agg({'tip' : np.max, 'size' : 'sum'})

               tip  size
day  smoker
Fri  No       3.50     9
     Yes      4.73    31
Sat  No       9.00   115
     Yes     10.00   104
Sun  No       6.00   167
     Yes      6.50    49
Thur No       6.70   112
     Yes      5.00    40

In [58]:
grouped.agg({'tip_pct' : ['min', 'max', 'mean', 'std'],
             'size' : 'sum'})

              tip_pct                               size
                  min       max      mean       std  sum
day  smoker
Fri  No      0.120385  0.187735  0.151650  0.028123    9
     Yes     0.103555  0.263480  0.174783  0.051293   31
Sat  No      0.056797  0.291990  0.158048  0.039767  115
     Yes     0.035638  0.325733  0.147906  0.061375  104
Sun  No      0.059447  0.252672  0.160113  0.042347  167
     Yes     0.065660  0.710345  0.187250  0.154134   49
Thur No      0.072961  0.266312  0.160298  0.038774  112
     Yes     0.090014  0.241255  0.163863  0.039389   40

In [59]:
tips.groupby(['day', 'smoker'], as_index=False).mean()

    day smoker  total_bill       tip      size   tip_pct
0   Fri     No   18.420000  2.812500  2.250000  0.151650
1   Fri    Yes   16.813333  2.714000  2.066667  0.174783
2   Sat     No   19.661778  3.102889  2.555556  0.158048
3   Sat    Yes   21.276667  2.875476  2.476190  0.147906
4   Sun     No   20.506667  3.167895  2.929825  0.160113
5   Sun    Yes   24.120000  3.516842  2.578947  0.187250
6  Thur     No   17.113111  2.673778  2.488889  0.160298
7  Thur    Yes   19.190588  3.030000  2.352941  0.163863

In [60]:
def top(df, n=5, column='tip_pct'):
  return df.sort_values(by=column)[-n:]
top(tips, n=6)

     total_bill   tip smoker  day    time  size   tip_pct
109       14.31  4.00    Yes  Sat  Dinner     2  0.279525
183       23.17  6.50    Yes  Sun  Dinner     4  0.280535
232       11.61  3.39     No  Sat  Dinner     2  0.291990
67         3.07  1.00    Yes  Sat  Dinner     1  0.325733
178        9.60  4.00    Yes  Sun  Dinner     2  0.416667
172        7.25  5.15    Yes  Sun  Dinner     2  0.710345

In [61]:
tips.groupby('smoker').apply(top)

            total_bill   tip smoker   day    time  size   tip_pct
smoker
No     88        24.71  5.85     No  Thur   Lunch     2  0.236746
       185       20.69  5.00     No   Sun  Dinner     5  0.241663
       51        10.29  2.60     No   Sun  Dinner     2  0.252672
       149        7.51  2.00     No  Thur   Lunch     2  0.266312
       232       11.61  3.39     No   Sat  Dinner     2  0.291990
Yes    109       14.31  4.00    Yes   Sat  Dinner     2  0.279525
       183       23.17  6.50    Yes   Sun  Dinner     4  0.280535
       67         3.07  1.00    Yes   Sat  Dinner     1  0.325733
       178        9.60  4.00    Yes   Sun  Dinner     2  0.416667
       172        7.25  5.15    Yes   Sun  Dinner     2  0.710345

In [62]:
tips.groupby(['smoker', 'day']).apply(top, n=1, column='total_bill')

                 total_bill    tip smoker   day    time  size   tip_pct
smoker day
No     Fri  94        22.75   3.25     No   Fri  Dinner     2  0.142857
       Sat  212       48.33   9.00     No   Sat  Dinner     4  0.186220
       Sun  156       48.17   5.00     No   Sun  Dinner     6  0.103799
       Thur 142       41.19   5.00     No  Thur   Lunch     5  0.121389
Yes    Fri  95        40.17   4.73    Yes   Fri  Dinner     4  0.117750
       Sat  170       50.81  10.00    Yes   Sat  Dinner     3  0.196812
       Sun  182       45.35   3.50    Yes   Sun  Dinner     3  0.077178
       Thur 197       43.11   5.00    Yes  Thur   Lunch     4  0.115982

In [63]:
result = tips.groupby('smoker')['tip_pct'].describe()
result

        count      mean       std  ...       50%       75%       max
smoker                             ...
No      151.0  0.159328  0.039910  ...  0.155625  0.185014  0.291990
Yes      93.0  0.163196  0.085119  ...  0.153846  0.195059  0.710345

[2 rows x 8 columns]

In [64]:
result.unstack('smoker')

       smoker
count  No        151.000000
       Yes        93.000000
mean   No          0.159328
       Yes         0.163196
std    No          0.039910
       Yes         0.085119
min    No          0.056797
       Yes         0.035638
25%    No          0.136906
       Yes         0.106771
50%    No          0.155625
       Yes         0.153846
75%    No          0.185014
       Yes         0.195059
max    No          0.291990
       Yes         0.710345
dtype: float64

In [66]:
f= lambda x: x.describe()
grouped.apply(f)

                   total_bill       tip  size   tip_pct
day  smoker
Fri  No     count    4.000000  4.000000  4.00  4.000000
            mean    18.420000  2.812500  2.25  0.151650
            std      5.059282  0.898494  0.50  0.028123
            min     12.460000  1.500000  2.00  0.120385
            25%     15.100000  2.625000  2.00  0.137239
...                       ...       ...   ...       ...
Thur Yes    min     10.340000  2.000000  2.00  0.090014
            25%     13.510000  2.000000  2.00  0.148038
            50%     16.470000  2.560000  2.00  0.153846
            75%     19.810000  4.000000  2.00  0.194837
            max     43.110000  5.000000  4.00  0.241255

[64 rows x 4 columns]

In [67]:
tips.groupby('smoker', group_keys=False).apply(top)

     total_bill   tip smoker   day    time  size   tip_pct
88        24.71  5.85     No  Thur   Lunch     2  0.236746
185       20.69  5.00     No   Sun  Dinner     5  0.241663
51        10.29  2.60     No   Sun  Dinner     2  0.252672
149        7.51  2.00     No  Thur   Lunch     2  0.266312
232       11.61  3.39     No   Sat  Dinner     2  0.291990
109       14.31  4.00    Yes   Sat  Dinner     2  0.279525
183       23.17  6.50    Yes   Sun  Dinner     4  0.280535
67         3.07  1.00    Yes   Sat  Dinner     1  0.325733
178        9.60  4.00    Yes   Sun  Dinner     2  0.416667
172        7.25  5.15    Yes   Sun  Dinner     2  0.710345

In [68]:
frame = pd.DataFrame({'data1': np.random.randn(1000),
                      'data2' : np.random.randn(1000)})
quartiles = pd.cut(frame.data1, 4)

quartiles[:10]

0     (-0.0302, 1.431]
1     (-0.0302, 1.431]
2     (-0.0302, 1.431]
3    (-1.492, -0.0302]
4     (-0.0302, 1.431]
5     (-0.0302, 1.431]
6     (-0.0302, 1.431]
7     (-0.0302, 1.431]
8     (-0.0302, 1.431]
9    (-1.492, -0.0302]
Name: data1, dtype: category
Categories (4, interval[float64]): [(-2.959, -1.492] < (-1.492, -0.0302] < (-0.0302, 1.431] <
                                    (1.431, 2.893]]

In [71]:
def get_stats(group):
  return {'min': group.min(), 'max': group.max(),
          'count': group.count(), 'mean': group.mean()}

grouped = frame.data2.groupby(quartiles)
grouped.apply(get_stats).unstack()

                        min       max  count      mean
data1
(-2.959, -1.492]  -2.058658  1.560129   54.0 -0.284222
(-1.492, -0.0302] -3.856341  2.956304  444.0 -0.046809
(-0.0302, 1.431]  -2.836136  2.550931  426.0  0.000261
(1.431, 2.893]    -2.302499  1.893848   76.0 -0.036924

In [72]:
grouping = pd.qcut(frame.data1, 10, labels=False)
groupied = frame.data2.groupby(grouping)
grouped.apply(get_stats).unstack()

                        min       max  count      mean
data1
(-2.959, -1.492]  -2.058658  1.560129   54.0 -0.284222
(-1.492, -0.0302] -3.856341  2.956304  444.0 -0.046809
(-0.0302, 1.431]  -2.836136  2.550931  426.0  0.000261
(1.431, 2.893]    -2.302499  1.893848   76.0 -0.036924

In [74]:
s = pd.Series(np.random.randn(6))
s[::2] = np.nan
s

0         NaN
1   -0.024778
2         NaN
3    2.915975
4         NaN
5   -0.538265
dtype: float64

In [75]:
s.fillna(s.mean())

0    0.784311
1   -0.024778
2    0.784311
3    2.915975
4    0.784311
5   -0.538265
dtype: float64

In [78]:
states = ['Ohio', 'New York', 'Vermont', 'Florida',
          'Oregon', 'Nevada', 'California', 'Idaho']

group_key = ['East'] * 4 + ['West'] *4
data = pd.Series(np.random.randn(8), index= states)
data

Ohio          0.683823
New York      0.245275
Vermont       1.203241
Florida      -2.393754
Oregon        0.389365
Nevada       -0.001405
California   -2.208195
Idaho         0.328238
dtype: float64

In [79]:
data[['Vermont', 'Nevada', 'Idaho']] = np.nan
data

Ohio          0.683823
New York      0.245275
Vermont            NaN
Florida      -2.393754
Oregon        0.389365
Nevada             NaN
California   -2.208195
Idaho              NaN
dtype: float64

In [80]:
data.groupby(group_key).mean()

East   -0.488219
West   -0.909415
dtype: float64

In [81]:
fill_mean = lambda g: g.fillna(g.mean())
data.groupby(group_key).apply(fill_mean)

Ohio          0.683823
New York      0.245275
Vermont      -0.488219
Florida      -2.393754
Oregon        0.389365
Nevada       -0.909415
California   -2.208195
Idaho        -0.909415
dtype: float64

In [82]:
fill_values = {'East': 0.5, 'West': -1}
fill_func = lambda g: g.fillna(fill_values[g.name])
data.groupby(group_key).apply(fill_func)

Ohio          0.683823
New York      0.245275
Vermont       0.500000
Florida      -2.393754
Oregon        0.389365
Nevada       -1.000000
California   -2.208195
Idaho        -1.000000
dtype: float64